export const faqs = [
  {
    question: "\"XXX 교수님 강의 추천해줘\" 라고 했는데 대답을 못해요",
    answer: "AI가 대답을 하기 위해서는 특정 사전에서 검색을 진행한 후, 검색 결과에 의해서 대답을 생성하기 때문에 \"어떤 단어를 사용하냐\"에 따라 결과가 다를 수 있어요. 따라서 '강의'와 유사한 '수업'과 같은 단어로 다양한 질의를 진행해주세요. 만약 챗봇이 대답하지 못했다면, 다음 업데이트에서 좋은 답변 품질을 위해 노력하겠습니다. 또한, 모든 내용은 참고용이므로 중요한 정보는 실제 자료에서 확인하시길 바랍니다.",
  },
  {
    question: "시간표 추천에서 나온 내용이 전부인가요?",
    answer: "아닙니다. 비용과 효율문제로 인해 현재 제공된 문서 내에서 일부 내용을 참고하여 AI가 대답하기 때문에 제공하는 답변의 시간표가 전부가 아닐 경우가 존재합니다. 참고용으로 사용해주시고 세부 내용에 대해서는 실제 PDF를 참고해주세요.",
  },
  {
    question: "학과 별 세부 졸업 요건에 대해서는 어디서 알 수 있나요?",
    answer: `각 학과 별 세부 졸업 요건은 매 학기 각 학과에서 공지합니다.

            저희 UniHelper에 각 학과별 졸업 요건을 학교 측에서 제공해주신다면
            챗봇에서 질의응답이 가능하나, 대외적으로 공개하기 민감한 부분을 포함하기 때문에
            협의 후 업데이트하겠습니다.
            `,
  },
  {
    question: "정확한 일정에 대해서 대답을 못하네요?",
    answer: "학사 일정에 따라 유동적일 수 있는 날짜 혹은 장학금 지급 관련 날짜 등에 대해서는 날짜를 예측할 수 없기 때문에 챗봇 서비스에서는 대답이 불가능합니다. 학교 혹은 장학과에 문의바랍니다.",
  },
];