// 학년 옵션
export const grades = ["1학년", "2학년", "3학년", "4학년"];

// 구분 옵션
export const categories = ["교양필수", "교양선택", "전공", "기초전공"];

// 요일 옵션
export const days = ["월요일", "화요일", "수요일", "목요일", "금요일"];

// 시간대 옵션
export const timePeriods = ["오전", "오후"];

// 학과 옵션
export const departments = [
  "유도학과", "유도경기지도학과",
  "무도학과", "태권도학과", "경호학과",
  "스포츠레저학과", "체육학과",
  "체육학과(야)","골프학부", 
  "골프학과","특수체육교육과",
  "무용과", "미디어디자인학과",
  "회화학과", "연극학과", "실용음악과",
  "국악과", "영화영상학과",
  "문화유산학과", "문화콘텐츠학과",
  "경영학과", "관광경영학과", "문화관광학과(야)",
  "경찰행정학과", "중국학과", "사회복지학과",
  "보건환경안전학과", "환경학과", "바이오생명공학과",
  "물리치료학과", "식품조리학부", "식품조리학부-외식조리",
  "식품조리학부-식품영양","AI융합학부",
  "AI융합학부-AI","AI융학학부-빅데이터전공",
];

export const basicdepartments = [
  "무도대학","체육과학대학",
  "무용과", "미디어디자인학과",
  "회화학과", "연극학과", "실용음악과",
  "국악과", "영화영상학과",
  "문화유산학과", "문화콘텐츠학과",
  "경영학과", "관광경영학과", "문화관광학과(야)",
  "경찰행정학과", "중국학과", "사회복지학과",
  "보건환경안전학과", "환경학과", "바이오생명공학과",
  "물리치료학과", "식품조리학부", "식품조리학부-외식조리",
  "식품조리학부-식품영양","AI융합학부",
  "AI융합학부-AI","AI융학학부-빅데이터전공",
];

// 교양 옵션
export const liberalArtsAreas = [
  "교양 1영역",
  "교양 2영역",
  "교양 3영역",
  "교양 4영역",
  "교양 5영역",
  "교양 6영역",
  "교양 7영역",
];

// 학점 옵션
export const credits = [1, 2, 3, 4];