// 학과 리스트
export const departments = [
  "유도학과","유도경기지도학과",
  "무도학과","태권도학과","경호학과",
  "스포츠레저학과","체육학과",
  "골프학부","특수체육교육과",
  "무용과","미디어디자인학과",
  "회화학과","연극학과",
  "국악과","영화영상학과",
  "문화유산학과","문화콘텐츠학과",
  "실용음악과","경영학과","관광경영학과",
  "경찰행정학과","중국학과","사회복지학과",
  "보건환경안전학과","바이오생명공학과",
  "물리치료학과","식품조리학부","AI융합학부",
  "무전공",
];

// 부서 리스트
export const departmentsStaff = [
  "총장 비서실","감사실",
  "부총장실","기획처",
  "교무처","교육혁신처",
  "학생처","사무처",
  "국제교류교육원","입학관리실",
  "기관생명윤리위원회","중앙도서관",
  "생활관","체육지원실",
  "신문방송국","박물관",
  "산학협력단","스포츠-웰니스연구센터",
  "정보관리실","예비군대대",
  "글로벌사회공헌원","단과대학 교학과",
  "대학원 교학과","총학생회",
  "무도대학 학생회","체육과학대학 학생회",
  "문화예술대학 학생회","인문사회융합대학 학생회",
  "AI바이오융합대학 학생회",
];

// 학기 리스트 (1학년 1학기 ~ 4학년 2학기)
export const semesters = [
  "1학년 1학기",
  "1학년 2학기",
  "2학년 1학기",
  "2학년 2학기",
  "3학년 1학기",
  "3학년 2학기",
  "4학년 1학기",
  "4학년 2학기",
];