// 학과 리스트
export const departments = [
  "유도학과","유도경기지도학과",
  "무도학과","태권도학과","경호학과",
  "스포츠레저학과","체육학과",
  "골프학부","특수체육교육과",
  "무용과","미디어디자인학과",
  "회화학과","연극학과",
  "국악과","영화영상학과",
  "문화유산학과","문화콘텐츠학과",
  "실용음악과","경영학과","관광경영학과",
  "경찰행정학과","중국학과","사회복지학과",
  "보건환경안전학과","바이오생명공학과",
  "물리치료학과","식품조리학부","AI융합학부",
  "무전공",
];

// 부서 리스트
export const departmentsStaff = [
  // 대학 본부
  "총장 비서실", "감사실", "부총장실",
  "기획예산과", "대외협력실", "평가성과분석센터", "혁신사업추진단",
  "교무지원과", "학사관리과", "교직과",
  "교수학습지원센터", "원격교육지원센터", "취창업지원센터", "학생생활상담센터",
  "학생지원과", "장학과", "장애학생지원센터",
  "총무지원과", "회계과", "안전관리과", "비상계획과",
  "국제교류교육과", "한국어학당",
  "입학관리실", "기관생명윤리위원회",

  // 부속기관
  "학술정보지원과", "학술정보열람과",
  "생활관", "체육지원실", "신문방송국", "박물관",
  "산학협력단", "스포츠-웰니스연구센터",
  "정보관리실", "예비군대대", "글로벌사회공헌원",
  "무도대 교학과", "체육과학대학 교학과", "문화예술대학 교학과",
  "인문사회융합대학 교학과", "AI바이오융합대학 교학과", "용오름대학 교양지원과",
  "대학원교학과", "스포츠과학대학원 교학과", "경영대학원 교학과",
  "교육대학원 교학과", "문화예술대학원 교학과", "재활복지대학원 교학과", "태권도대학원 교학과",

  // 학생회
  "총학생회",
  "유도학과 학생회", "유도경기지도학과 학생회", "무도학과 학생회", "태권도학과 학생회", "경호학과 학생회",
  "스포츠레저학과 학생회", "체육학과 학생회", "골프학부 학생회", "특수체육교육과 학생회",
  "무용과 학생회", "미디어디자인학과 학생회", "회화학과 학생회", "연극학과 학생회", "국악과 학생회",
  "영화영상학과 학생회", "문화유산학과 학생회", "문화콘텐츠학과 학생회", "실용음악과 학생회",
  "경영학과 학생회", "관광경영학과 학생회", "경찰행정학과 학생회", "중국학과 학생회", "사회복지학과 학생회",
  "보건환경안전학과 학생회", "바이오생명공학과 학생회", "물리치료학과 학생회",
  "식품조리학부 학생회", "AI융합학부 학생회",
];

// 학기 리스트 (1학년 1학기 ~ 4학년 2학기)
export const semesters = [
  "1학년 1학기",
  "1학년 2학기",
  "2학년 1학기",
  "2학년 2학기",
  "3학년 1학기",
  "3학년 2학기",
  "4학년 1학기",
  "4학년 2학기",
];